Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils.UpdateDirectContext3DHandleType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Updates a DirectContext3D handle type element based on the information reported by the corresponding DirectContext3D server.
aDocument:
The document.
view:
A view in the document that will be used when generating the bounding box of the handle element. Can be null.
handleTypeId:
The ID of the handle type element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the Element ID handleTypeId does not correspond to a valid DirectContext3D handle type.
-or-
Thrown if a view is provided as an argument, but it is not a graphical view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the DirectContext3D server associated with the handle type element could not be obtained.
-or-
Thrown if handle type geometry could not be created based on the bounding box provided by the DirectContext3D server.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils.CreateDirectContext3DHandleInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a DirectContext3D handle instance element based on the specified handle type element.
aDocument:
The document.
handleTypeId:
The ID of the handle type element.
Returns:
The created handle instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the Element ID handleTypeId does not correspond to a valid DirectContext3D handle type.
-or-
aDocument is not a project document.
-or-
aDocument is not a primary document, it is a linked document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the handle instance could not be created based on the specified handle type element.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils.CreateDirectContext3DHandleType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer,Autodesk.Revit.DB.ElementId)
Creates a DirectContext3D handle type element based on the information provided by the specified DirectContext3D server.
aDocument:
The document.
view:
A view in the document that will be used when generating the bounding box of the handle element. Can be null.
server:
The DirectContext3D server that provides content associated with the handle type.
handleCategory:
The DirectContext3D handle category to assign to the new handle.
Returns:
The created handle type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the category ID handleCategory is not valid for DirectContext3D handles.
-or-
aDocument is not a project document.
-or-
aDocument is not a primary document, it is a linked document.
-or-
Thrown if a view is provided as an argument, but it is not a graphical view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if handle type geometry could not be created based on the bounding box provided by the DirectContext3D server.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils.GetDirectContext3DHandleInstances(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns all DirectContext3D handle instances of the given category in the document.
aDocument:
The document.
handleCategory:
A category of DirectContext3D handles.
Returns:
The set of DirectContext3D handle instances of the given category.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the category ID handleCategory is not valid for DirectContext3D handles.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils.GetDirectContext3DHandleTypes(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns all DirectContext3D handle types of the given category in the document.
aDocument:
The document.
handleCategory:
A category of DirectContext3D handles.
Returns:
The set of DirectContext3D handle types of the given category.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the category ID handleCategory is not valid for DirectContext3D handles.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils.IsADirectContext3DHandleInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks whether the provided Element ID corresponds to a DirectContext3D handle instance element.
Remarks:
DirectContext3D handle instances are DirectShapes.
aDocument:
The document.
elementId:
The ID of the element to check.
Returns:
True, if the element is a valid DirectContext3D handle instance, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
aDocument is not a project document.
-or-
elementId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils.IsADirectContext3DHandleType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks whether the provided Element ID corresponds to a DirectContext3D handle type element.
Remarks:
DirectContext3D handle types are DirectShapeTypes.
aDocument:
The document.
elementId:
The ID of the element to check.
Returns:
True, if the element is a valid DirectContext3D handle type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
aDocument is not a project document.
-or-
elementId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils.IsADirectContext3DHandleCategory(Autodesk.Revit.DB.ElementId)
Checks whether the provided category ID is one of the categories used by DirectContext3D handle elements.
categoryId:
The category ID to check.
Returns:
True, if the category is valid for DirectContext3D handle elements, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils
The methods provided by this utility class support the use of DirectContext3D and storage of DirectContext3D handle elements in Revit documents.
Remarks:
DirectContext3D graphics can be displayed without storing the graphics in elements. However, the reference to the externally generated
graphics will not persist beyond the current session, and there will be no capabilities for the user to select and interact with the graphics.
The utility methods in this class support creation and updating of DirectContext3D handle and handle instance elements (which for this release are
Autodesk::Revit::DB::DirectShapeType and Autodesk::Revit::DB::DirectShape instances, however this may not always be the
case). The capabilities provided by these handle elements include:
A special geometry object remembers the existence and source location of the external graphics.A generated 3D bounding box surrounds the provided graphics.  This box is set to be selectable but its properties are mostly not modifiable.
However, the user can reposition the box and the associated external graphics with it.
The type and instance relationship between DirectContext3D handles and handle instances allows one DirectContext3D server to act as the provider
of one set of graphics (the type) that the API displays in multiple locations, as determined by the handle instances.
The handle element will be associated to a specified category. The only currently valid category is OST_Coordination_Model.
The application is required to update the handle type element using Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils.UpdateDirectContext3DHandleType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId) whenever the source data
changes. It also is required that the application update the handle during initial load of the document containing this element.
Since:
2018